import { StaticImageData } from "next/image";
import photo1 from "./photos/1.jpg";
import photo2 from "./photos/2.jpg";
import photo3 from "./photos/3.jpg";
import photo4 from "./photos/4.jpg";
import photo5 from "./photos/5.jpg";

export type WonderImage = {
  id: string;
  name: string;
  src: StaticImageData;
  description: string;
  location: string;
};

const wondersImages: WonderImage[] = [
  {
    id: "1",
    name: "ጊሸን ማርያም",
    src: photo1,
    description: "ይህ ፎቶ የሚያሳየው በግሸን ማርያም ቤተ ክርስቲያን ውስጥ ያለው አንዱ ዋና እና ታሪካዊ የቤተ ክርስቲያን ሕንፃ ነው። በምስሉ ላይ የሚታይ ሕንፃ በብዙ እግረኛ አምዶች የተከበበ፣ ከፍተኛ የታንጎ ጣሪያ ያለው እና በቀይ እና አረንጓዴ ቀለም የተሰራ ነው ከውጭ አጠገብ ላይ መቀመጫ ያደረጉ ሃዋርያት በሚታዩበት ጊዜ ነው። በግሸን ማርያም ቤተ ክርስቲያን ይህ ዓይነት ሕንፃ ልዩ መንፈሳዊ እና ባህላዊ ትርጉም አለው፣ በተለይ የመስቀል በዓልን ሲያከብሩ በዚህ እንደ ዋና የስንቅ ቦታ ይጠቀሙበታል። እፈልጋለሁ ከምስሉ ጋር የግሸን ማርያም ታሪክና መንፈሳዊ ትርጉም በአማርኛ ዝርዝር መግለጫ እሰጥልዎ።",
    location: "ደቡብ ወሎ",
  },
  {
    id: "2",
    name: "የአክሱም ሃዉልት",
    src: photo2,
    description: "አክሱም ሃውልት በኢትዮጵያ ሰሜን በትንሹ ከተማ አክሱም ውስጥ ያሉ ታላላቅ የድንጋይ ሐውልቶች ናቸው። እነዚህ ሐውልቶች በድንጋይ ከአንድ ብቻ ተቆርጠው የተሰሩ ሲሆን እስከ ከፍታ 33 ሜትር የሚደርሱ ያሉ ታላላቅ ቅርሶች ናቸው። በታሪክ መሠረት አክሱም ሐውልቶች በአክሱም ግዛት (ከክ.ዓ 1ኛ ክፍለ ዘመን ጀምሮ) እንደ መቃብር ምልክት በተለይ ለነገሥታት እና ለከፍተኛ ባለሀብት የተሠሩ ናቸው። ሐውልቶቹ በአካል ላይ የተቀረጹ የቤት መስኮቶችና በር ያሉባቸው ስነ-ጥበብ ይዟል፣ ይህም በዚያን ጊዜ የነበረውን የአክሱም ህንፃ ስርዓት ይወክላል።",
    location: "በትግራይ ክልል አክሱም",
  },
  {
    id: "3",
    name: "ጭላዳ ባቡን",
    src: photo3,
    description: "ጭላዳ ባቡን ሰመን ብሔራዊ ፓርክ በኢትዮጵያ  ውስጥ ያለ አስደናቂ ብርክየ እንስሳት ነው። ፓርኩ በባህር ዳርቻ ያለ ከፍተኛ ድንጋይ ግድግዳዎች፣ በረዶ ያላቸው ኮረብታዎች በተለይ የተየተለያዩ ብርክየ እንሲሳት ይገኙበታል። የግድግዳዎቹ ቀጭን እና ቀይ የድንጋይ ቀለም ዓለም ዙሪያ የሚጓዙ ቱሪስቶችን ይሳበባል።",
    location: " ሰመን ብሔራዊ ፓርክ በኢትዮጵያ",
  },
  {
    id: "4",
    name: "ቢተ ጊወጊስ",
    src: photo4,
    description: "ይህ ፎቶ በላሊበላ ያለውን በድንጋይ የተቀረጸ ታላቅ ቤተ ክርስቲያን ያሳያል። ቤተ ክርስቲያኑ ከመሬት አንድ ብቻ ድንጋይ በመቀረጥ በ13ኛው ክፍለ ዘመን በንጉስ ላሊበላ ዘመን የተፈለፈለ ነው። ይዚህ ቤተ ክርስቲያን እና ለሎቹም አስሩ በዩኔስኮ የዓለም ቅርስ ዝርዝር ውስጥ እንደተመዘገቡ በአለም ዙሪያ የቱሪስት መስራት በጣም ታዋቂ ናቸው።"
,
    location: "በሰመን ወሎ",
  },
  {
    id: "5",
    name: "እጦጦ ቅድስት ድንግል ማርያም ቤተ ክርስቲያን",
    src: photo5,
    description: "ይህ ፎቶ የኢትዮጵያ ታላቅ መካነ ኢትዮጵያ ቤተ ክርስቲያን በአዲስ አበባ እንጦጦ ያለው ኦርቶዶክስ ተዋሕዶ  ቤተ ክርስቲያን ያሳያል። ቤተ ክርስቲያኑ በደቡብ አፍሪካዊ ቅርጽ እና በተለየ ቀለም አስደናቂ ስነ-ሕንፃ ተጌጥቶ የተገነባ ነው። በማዕከላዊ ጣቢያ እና በጠለፋ መዋቅር ላይ ያለው ይህ መሠረታዊ ቤተ ክርስቲያን በመንፈሳዊ እምነት ታላቅ ምስክር ነው።",
    location: "አዲስ አባባ",
  },

];

export default wondersImages;